"use strict";

let incr = 10,
    decr = 10;
// Постфексный способ 
// incr++;         // 1 способ задания оператора инкремент
// decr--;         // 1 способ задания оператора декремент 
//  console.log(incr);
//  console.log(decr);
// Префексный спрособ 
//  ++incr;           // 2 способ задания оператора инкремента
//  --decr;           // 2 способ задания оператора декремента
//  console.log(incr);
//  console.log(decr);

// console.log(incr++);  // при постфексном способе сначала будет выводится старое значение
// console.log(decr--);  // при постфексном способе сначала будет выводится старое значение

console.log(++incr); // при префексном способе значения будут сразу меняться на 1
console.log(--decr); // при префексном способе значения будут сразу меняться на 1

console.log(10 % 3); // знак % показывает какой остаток будет в ходе деления на число

console.log(4 * 2 == 8); // пример сравнения двойной знак равно это сравнение

console.log(4 * 2 == "8"); // пример сравнения по значению, все арвно в консоле будет true

console.log(4 * 2 === "8"); // 3 знака равно это строгое равенство которое сравнивает значения, в консоле будет false 

// const isChecked = true;
// const isClose = true;

// // console.log(isChecked && isClose);  // пример оператора И

// // console.log(isChecked || isClose);  // пример оператора ИЛИ 

const isChecked = false,
    isClose = false;
console.log(isChecked || !isClose); // пример оператора Отрицания "!"

console.log(2 + 2 * 2 !== "6");